glcloud/keil_v5/ARM/PACK/.Web/Keil.Kinetis_KWxx_DFP.pdsc
          <book name="Documents/MKW36Z512.pdf"   title="MKW35/36 Data Sheet"/>
          <book name="Documents/MKW36A512RM.pdf" title="MKW35/36 Reference Manual"/>
        </device>
      </subFamily>
    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <!--condition id="ARMCC6">
      <accept Tcompiler="ARMCC" Toptions="AC6"/>
      <accept Tcompiler="ARMCC" Toptions="AC6LTO"/>
    </condition-->
    <!--condition id="ARMCC5">
      <require Tcompiler="ARMCC" Toptions="AC5"/>
    </condition-->
    <condition id="ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="GCC">
      <require Tcompiler="GCC"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="MKW01Z4 CMSIS">
      <description>NXP Kinetis KW01 48MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKW01Z128xxx4"/>
    </condition>

    <condition id="MKW21D5 CMSIS">
      <description>NXP Kinetis KW21 50MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKW21D256xxx5"/>
      <accept Dname="MKW21D512xxx5"/>
    </condition>

    <condition id="MKW22D5 CMSIS">
      <description>NXP Kinetis KW22 50MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKW22D512xxx5"/>
    </condition>

    <condition id="MKW24D5 CMSIS">
      <description>NXP Kinetis KW24 50MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKW24D512xxx5"/>
    </condition>

    <condition id="MKW20Z4 CMSIS">
      <description>NXP Kinetis KW20 48MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKW20Z160xxx4"/>
    </condition>

    <condition id="MKW30Z4 CMSIS">
      <description>NXP Kinetis KW30 48MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKW30Z160xxx4"/>
    </condition>

    <condition id="MKW40Z4 CMSIS">
      <description>NXP Kinetis KW40 48MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKW40Z160xxx4"/>
    </condition>

    <condition id="MKW21Z4 CMSIS">
      <description>NXP Kinetis KW21 48MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKW21Z256xxx4"/>
      <accept Dname="MKW21Z512xxx4"/>
    </condition>

    <condition id="MKW31Z4 CMSIS">
      <description>NXP Kinetis KW31 48MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKW31Z256xxx4"/>
      <accept Dname="MKW31Z512xxx4"/>
    </condition>

    <condition id="MKW41Z4 CMSIS">
      <description>NXP Kinetis KW41 48MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKW41Z256xxx4"/>
      <accept Dname="MKW41Z512xxx4"/>
    </condition>

    <condition id="MKW35A4_CMSIS">
      <description>NXP Kinetis KW35A 48MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKW35A512xxx4"/>
    </condition>

    <condition id="MKW35Z4_CMSIS">
      <description>NXP Kinetis KW35Z 48MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKW35Z512xxx4"/>
    </condition>

    <condition id="MKW36A4_CMSIS">
      <description>NXP Kinetis KW36A 48MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKW36A512xxx4"/>
    </condition>

    <condition id="MKW36Z4_CMSIS">
      <description>NXP Kinetis KW36Z 48MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKW36Z512xxx4"/>
    </condition>

    <condition id="MKW36x4_CMSIS">
      <description>NXP Kinetis KW36A/Z 48MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKW36A512xxx4"/>
      <accept Dname="MKW36Z512xxx4"/>
    </condition>
  </conditions>

  <components>
    <!-- Startup MKW01Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKW01Z4 CMSIS">
      <description>System Startup for Kinetis KW01 48MHz Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKW01Z4.s"  attr="config" version="1.0.0" condition="ARMCC"/>
        <file category="source"  name="Device/Source/system_MKW01Z4.c"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKW21D5 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKW21D5 CMSIS">
      <description>System Startup for Kinetis KW01 48MHz Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKW21D5.s"  attr="config" version="1.0.0" condition="ARMCC"/>
        <file category="source"  name="Device/Source/system_MKW21D5.c"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKW22D5 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKW22D5 CMSIS">
      <description>System Startup for Kinetis KW01 48MHz Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKW22D5.s"  attr="config" version="1.0.0" condition="ARMCC"/>
        <file category="source"  name="Device/Source/system_MKW22D5.c"       attr="config" version="1.0.0"/>
      </files>
    </component>

