glcloud/keil_v5/ARM/PACK/.Web/Keil.Kinetis_KWxx_DFP.pdsc
    <!-- Startup MKW24D5 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKW24D5 CMSIS">
      <description>System Startup for Kinetis KW01 48MHz Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKW24D5.s"  attr="config" version="1.0.0" condition="ARMCC"/>
        <file category="source"  name="Device/Source/system_MKW24D5.c"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKW20Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKW20Z4 CMSIS">
      <description>System Startup for Kinetis KW20 48MHz Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKW20Z4.s"  attr="config" version="1.0.0" condition="ARMCC"/>
        <file category="source"  name="Device/Source/system_MKW20Z4.c"       attr="config" version="1.0.0"/>
        <file category="header"  name="Device/Source/system_MKW20Z4.h"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKW30Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKW30Z4 CMSIS">
      <description>System Startup for Kinetis KW30 48MHz Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKW30Z4.s"  attr="config" version="1.0.0" condition="ARMCC"/>
        <file category="source"  name="Device/Source/system_MKW30Z4.c"       attr="config" version="1.0.0"/>
        <file category="header"  name="Device/Source/system_MKW30Z4.h"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKW40Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKW40Z4 CMSIS">
      <description>System Startup for Kinetis KW4x 48MHz Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKW40Z4.s"  attr="config" version="1.0.0" condition="ARMCC"/>
        <file category="source"  name="Device/Source/system_MKW40Z4.c"       attr="config" version="1.0.0"/>
        <file category="header"  name="Device/Source/system_MKW40Z4.h"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKW21Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKW21Z4 CMSIS">
      <description>System Startup for Kinetis KW21 48MHz Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKW21Z4.s"  attr="config" version="1.0.0" condition="ARMCC"/>
        <file category="source"  name="Device/Source/system_MKW21Z4.c"       attr="config" version="1.0.0"/>
        <file category="header"  name="Device/Source/system_MKW21Z4.h"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKW31Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKW31Z4 CMSIS">
      <description>System Startup for Kinetis KW31 48MHz Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKW31Z4.s"  attr="config" version="1.0.0" condition="ARMCC"/>
        <file category="source"  name="Device/Source/system_MKW31Z4.c"       attr="config" version="1.0.0"/>
        <file category="header"  name="Device/Source/system_MKW31Z4.h"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKW41Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKW41Z4 CMSIS">
      <description>System Startup for Kinetis KW41 48MHz Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKW41Z4.s"  attr="config" version="1.0.0" condition="ARMCC"/>
        <file category="source"  name="Device/Source/system_MKW41Z4.c"       attr="config" version="1.0.0"/>
        <file category="header"  name="Device/Source/system_MKW41Z4.h"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKW35A4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKW35A4_CMSIS">
      <description>System Startup for Kinetis KW35A 48MHz Devices</description>
      <files>
        <!-- include folders -->
        <file category="include"      name="Device/MKW35A4/Include/"/>

        <!-- startup files -->
        <file category="sourceAsm"    name="Device/MKW35A4/Source/arm/startup_MKW35A4.s"                  attr="config" version="1.3.0" condition="ARMCC"/>
        <file category="sourceC"      name="Device/MKW35A4/Source/gcc/startup_MKW35A4.S"                  attr="config" version="1.3.0" condition="GCC"/>

        <!-- system files -->
        <file category="sourceC"      name="Device/MKW35A4/Source/system_MKW35A4.c"                       attr="config" version="1.3.0"/>
        <file category="header"       name="Device/MKW35A4/Source/system_MKW35A4.h"                       attr="config" version="1.3.0"/>

        <!-- linker scripts -->
        <file category="linkerScript" name="Device/MKW35A4/Source/arm/MKW35A512xxx4_flash.scf"            attr="config" version="1.1.0" condition="ARMCC"/>
        <file category="linkerScript" name="Device/MKW35A4/Source/arm/MKW35A512xxx4_flash_ram_vector.scf" attr="config" version="1.1.0" condition="ARMCC"/>
        <file category="linkerScript" name="Device/MKW35A4/Source/arm/MKW35A512xxx4_ram.scf"              attr="config" version="1.1.0" condition="ARMCC"/>
        <file category="linkerScript" name="Device/MKW35A4/Source/arm/MKW35A512xxx4_ram_ram_vector.scf"   attr="config" version="1.1.0" condition="ARMCC"/>

        <file category="linkerScript" name="Device/MKW35A4/Source/gcc/MKW35A512xxx4_flash.ld"             attr="config" version="1.1.0" condition="GCC"/>
        <file category="linkerScript" name="Device/MKW35A4/Source/gcc/MKW35A512xxx4_flash_ram_vector.ld"  attr="config" version="1.1.0" condition="GCC"/>
        <file category="linkerScript" name="Device/MKW35A4/Source/gcc/MKW35A512xxx4_ram.ld"               attr="config" version="1.1.0" condition="GCC"/>
        <file category="linkerScript" name="Device/MKW35A4/Source/gcc/MKW35A512xxx4_ram_ram_vector.ld"    attr="config" version="1.1.0" condition="GCC"/>
     </files>
    </component>

    <!-- Startup MKW35Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKW35Z4_CMSIS">
      <description>System Startup for Kinetis KW35Z 48MHz Devices</description>
      <files>
        <!-- include folders -->
        <file category="include"      name="Device/MKW35Z4/Include/"/>

        <!-- startup files -->
        <file category="sourceAsm"    name="Device/MKW35Z4/Source/arm/startup_MKW35Z4.s"                  attr="config" version="1.3.0" condition="ARMCC"/>
        <file category="sourceC"      name="Device/MKW35Z4/Source/gcc/startup_MKW35Z4.S"                  attr="config" version="1.3.0" condition="GCC"/>

        <!-- system files -->
        <file category="sourceC"      name="Device/MKW35Z4/Source/system_MKW35Z4.c"                       attr="config" version="1.3.0"/>
        <file category="header"       name="Device/MKW35Z4/Source/system_MKW35Z4.h"                       attr="config" version="1.3.0"/>

